In [15]:
import pandas as pd
import numpy as np

In [16]:
dates = pd.date_range('20230101', periods=6)
cities = ['New York', 'Los Angeles']

index = pd.MultiIndex.from_product([dates, cities], names=['date', 'city'])
data = np.random.randn(12, 1)

df = pd.DataFrame(data, index=index, columns=['value'])
df

                           value
date       city
2023-01-01 New York     1.095927
           Los Angeles  0.059410
2023-01-02 New York     0.115798
           Los Angeles  0.010732
2023-01-03 New York     0.240101
           Los Angeles -1.075021
2023-01-04 New York    -0.577826
           Los Angeles -0.335503
2023-01-05 New York     0.434832
           Los Angeles  0.382413
2023-01-06 New York    -0.428821
           Los Angeles  0.172599

In [17]:
df.index

MultiIndex([('2023-01-01',    'New York'),
            ('2023-01-01', 'Los Angeles'),
            ('2023-01-02',    'New York'),
            ('2023-01-02', 'Los Angeles'),
            ('2023-01-03',    'New York'),
            ('2023-01-03', 'Los Angeles'),
            ('2023-01-04',    'New York'),
            ('2023-01-04', 'Los Angeles'),
            ('2023-01-05',    'New York'),
            ('2023-01-05', 'Los Angeles'),
            ('2023-01-06',    'New York'),
            ('2023-01-06', 'Los Angeles')],
           names=['date', 'city'])

In [18]:
df.index.names

FrozenList(['date', 'city'])

In [19]:
# Data for New York
ny_data = df.xs('New York', level='city')
ny_data

               value
date
2023-01-01  1.095927
2023-01-02  0.115798
2023-01-03  0.240101
2023-01-04 -0.577826
2023-01-05  0.434832
2023-01-06 -0.428821

In [20]:
# Data for a specific date range
date_range_data = df.loc['20230101':'20230103']
date_range_data

                           value
date       city
2023-01-01 New York     1.095927
           Los Angeles  0.059410
2023-01-02 New York     0.115798
           Los Angeles  0.010732
2023-01-03 New York     0.240101
           Los Angeles -1.075021

In [21]:
# Resampling to get monthly data
monthly_data = df.resample('M', level='date').mean()
monthly_data

               value
date
2023-01-31  0.007887

In [22]:
# Aggregating data by city
city_agg = df.groupby(level='city').mean()
city_agg

                value
city
Los Angeles -0.130895
New York     0.146669

In [23]:
df.unstack(level='city')

                 value
city       Los Angeles  New York
date
2023-01-01    0.059410  1.095927
2023-01-02    0.010732  0.115798
2023-01-03   -1.075021  0.240101
2023-01-04   -0.335503 -0.577826
2023-01-05    0.382413  0.434832
2023-01-06    0.172599 -0.428821

In [24]:
df.unstack(level='date')

                 value
date        2023-01-01 2023-01-02 2023-01-03 2023-01-04 2023-01-05 2023-01-06
city
Los Angeles   0.059410   0.010732  -1.075021  -0.335503   0.382413   0.172599
New York      1.095927   0.115798   0.240101  -0.577826   0.434832  -0.428821

In [25]:
pivot = df.unstack(level='city').pivot_table(values='value', index='date')
pivot

city        Los Angeles  New York
date
2023-01-01     0.059410  1.095927
2023-01-02     0.010732  0.115798
2023-01-03    -1.075021  0.240101
2023-01-04    -0.335503 -0.577826
2023-01-05     0.382413  0.434832
2023-01-06     0.172599 -0.428821

In [26]:
df.index.levels[0]

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', name='date', freq='D')

In [27]:
df.index.levels[1]

Index(['Los Angeles', 'New York'], dtype='object', name='city')

In [28]:
# Assuming 'df' has a timezone-aware DateTimeIndex
df.index = df.index.set_levels([df.index.levels[0].tz_localize('UTC').tz_convert('America/New_York'), df.index.levels[1]])
df.index

MultiIndex([('2022-12-31 19:00:00-05:00',    'New York'),
            ('2022-12-31 19:00:00-05:00', 'Los Angeles'),
            ('2023-01-01 19:00:00-05:00',    'New York'),
            ('2023-01-01 19:00:00-05:00', 'Los Angeles'),
            ('2023-01-02 19:00:00-05:00',    'New York'),
            ('2023-01-02 19:00:00-05:00', 'Los Angeles'),
            ('2023-01-03 19:00:00-05:00',    'New York'),
            ('2023-01-03 19:00:00-05:00', 'Los Angeles'),
            ('2023-01-04 19:00:00-05:00',    'New York'),
            ('2023-01-04 19:00:00-05:00', 'Los Angeles'),
            ('2023-01-05 19:00:00-05:00',    'New York'),
            ('2023-01-05 19:00:00-05:00', 'Los Angeles')],
           names=['date', 'city'])